FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_dsu.h
/**
 * \file
 *
 * \brief Component description for DSU
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_DSU_COMPONENT_
#define _SAMD20_DSU_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR DSU */
/* ========================================================================== */
/** \addtogroup SAMD20_DSU Device Service Unit */
/*@{*/

#define REV_DSU    0x101

/* -------- DSU_CTRL : (DSU Offset: 0x0000) ( /W  8) Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t SWRST : 1; /*!< bit:      0  Software Reset                     */
            uint8_t  : 1;      /*!< bit:      1  Reserved                           */
            uint8_t CRC : 1;   /*!< bit:      2  Cyclic Redundancy Check            */
            uint8_t MBIST : 1; /*!< bit:      3  Memory BIST                        */
            uint8_t CE : 1;    /*!< bit:      4  Chip Erase                         */
            uint8_t  : 1;      /*!< bit:      5  Reserved                           */
            uint8_t ARR : 1;   /*!< bit:      6  Auxiliary Row Read                 */
            uint8_t SMSA : 1;  /*!< bit:      7  Start Memory Stream Access         */
        } bit;                 /*!< Structure used for bit  access                  */
        uint8_t reg;           /*!< Type      used for register access              */
    } DSU_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_CTRL_OFFSET       0x0000             /**< \brief (DSU_CTRL offset) Control Register */

#define DSU_CTRL_SWRST_Pos    0                  /**< \brief (DSU_CTRL) Software Reset */
#define DSU_CTRL_SWRST        ( 0x1u << DSU_CTRL_SWRST_Pos )
#define DSU_CTRL_CRC_Pos      2                  /**< \brief (DSU_CTRL) Cyclic Redundancy Check */
#define DSU_CTRL_CRC          ( 0x1u << DSU_CTRL_CRC_Pos )
#define DSU_CTRL_MBIST_Pos    3                  /**< \brief (DSU_CTRL) Memory BIST */
#define DSU_CTRL_MBIST        ( 0x1u << DSU_CTRL_MBIST_Pos )
#define DSU_CTRL_CE_Pos       4                  /**< \brief (DSU_CTRL) Chip Erase */
#define DSU_CTRL_CE           ( 0x1u << DSU_CTRL_CE_Pos )
#define DSU_CTRL_ARR_Pos      6                  /**< \brief (DSU_CTRL) Auxiliary Row Read */
#define DSU_CTRL_ARR          ( 0x1u << DSU_CTRL_ARR_Pos )
#define DSU_CTRL_SMSA_Pos     7                  /**< \brief (DSU_CTRL) Start Memory Stream Access */
#define DSU_CTRL_SMSA         ( 0x1u << DSU_CTRL_SMSA_Pos )
#define DSU_CTRL_MASK         0xDDu              /**< \brief (DSU_CTRL) MASK Register */

/* -------- DSU_STATUSA : (DSU Offset: 0x0001) (R/W  8) Status Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t DONE : 1;    /*!< bit:      0  Done                               */
            uint8_t CRSTEXT : 1; /*!< bit:      1  CPU Reset Phase Extension          */
            uint8_t BERR : 1;    /*!< bit:      2  Bus Error                          */
            uint8_t FAIL : 1;    /*!< bit:      3  Failure                            */
            uint8_t PERR : 1;    /*!< bit:      4  Protection Error                   */
            uint8_t  : 3;        /*!< bit:  5.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } DSU_STATUSA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_STATUSA_OFFSET         0x0001        /**< \brief (DSU_STATUSA offset) Status Register A */

#define DSU_STATUSA_DONE_Pos       0             /**< \brief (DSU_STATUSA) Done */
#define DSU_STATUSA_DONE           ( 0x1u << DSU_STATUSA_DONE_Pos )
#define DSU_STATUSA_CRSTEXT_Pos    1             /**< \brief (DSU_STATUSA) CPU Reset Phase Extension */
#define DSU_STATUSA_CRSTEXT        ( 0x1u << DSU_STATUSA_CRSTEXT_Pos )
#define DSU_STATUSA_BERR_Pos       2             /**< \brief (DSU_STATUSA) Bus Error */
#define DSU_STATUSA_BERR           ( 0x1u << DSU_STATUSA_BERR_Pos )
#define DSU_STATUSA_FAIL_Pos       3             /**< \brief (DSU_STATUSA) Failure */
#define DSU_STATUSA_FAIL           ( 0x1u << DSU_STATUSA_FAIL_Pos )
#define DSU_STATUSA_PERR_Pos       4             /**< \brief (DSU_STATUSA) Protection Error */
#define DSU_STATUSA_PERR           ( 0x1u << DSU_STATUSA_PERR_Pos )
#define DSU_STATUSA_MASK           0x1Fu         /**< \brief (DSU_STATUSA) MASK Register */

/* -------- DSU_STATUSB : (DSU Offset: 0x0002) (R/   8) Status Register B -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t PROT : 1;    /*!< bit:      0  Protected                          */
            uint8_t DBGPRES : 1; /*!< bit:      1  Debugger Present                   */
            uint8_t DCCD : 2;    /*!< bit:  2.. 3  Debug Communication Channel Dirty  */
            uint8_t HPE : 1;     /*!< bit:      4  Hot-Plugging Enable                */
            uint8_t  : 3;        /*!< bit:  5.. 7  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } DSU_STATUSB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_STATUSB_OFFSET         0x0002        /**< \brief (DSU_STATUSB offset) Status Register B */
#define DSU_STATUSB_RESETVALUE     0x00          /**< \brief (DSU_STATUSB reset_value) Status Register B */

#define DSU_STATUSB_PROT_Pos       0             /**< \brief (DSU_STATUSB) Protected */
#define DSU_STATUSB_PROT           ( 0x1u << DSU_STATUSB_PROT_Pos )
#define DSU_STATUSB_DBGPRES_Pos    1             /**< \brief (DSU_STATUSB) Debugger Present */
#define DSU_STATUSB_DBGPRES        ( 0x1u << DSU_STATUSB_DBGPRES_Pos )
#define DSU_STATUSB_DCCD_Pos       2             /**< \brief (DSU_STATUSB) Debug Communication Channel Dirty */
#define DSU_STATUSB_DCCD_Msk       ( 0x3u << DSU_STATUSB_DCCD_Pos )
#define DSU_STATUSB_DCCD( value )    ( ( DSU_STATUSB_DCCD_Msk & ( ( value ) << DSU_STATUSB_DCCD_Pos ) ) )
#define DSU_STATUSB_HPE_Pos        4             /**< \brief (DSU_STATUSB) Hot-Plugging Enable */
#define DSU_STATUSB_HPE            ( 0x1u << DSU_STATUSB_HPE_Pos )
#define DSU_STATUSB_MASK           0x1Fu         /**< \brief (DSU_STATUSB) MASK Register */

/* -------- DSU_ADDR : (DSU Offset: 0x0004) (R/W 32) Address Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t AMOD : 2;  /*!< bit:  0.. 1  Access Mode                        */
            uint32_t ADDR : 30; /*!< bit:  2..31  Address                            */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_ADDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_ADDR_OFFSET        0x0004            /**< \brief (DSU_ADDR offset) Address Register */
#define DSU_ADDR_RESETVALUE    0x00000000        /**< \brief (DSU_ADDR reset_value) Address Register */

