FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_dsu.h
#define DSU_ADDR_AMOD_Pos      0                 /**< \brief (DSU_ADDR) Access Mode */
#define DSU_ADDR_AMOD_Msk      ( 0x3u << DSU_ADDR_AMOD_Pos )
#define DSU_ADDR_AMOD( value )    ( ( DSU_ADDR_AMOD_Msk & ( ( value ) << DSU_ADDR_AMOD_Pos ) ) )
#define DSU_ADDR_ADDR_Pos      2                 /**< \brief (DSU_ADDR) Address */
#define DSU_ADDR_ADDR_Msk      ( 0x3FFFFFFFu << DSU_ADDR_ADDR_Pos )
#define DSU_ADDR_ADDR( value )    ( ( DSU_ADDR_ADDR_Msk & ( ( value ) << DSU_ADDR_ADDR_Pos ) ) )
#define DSU_ADDR_MASK          0xFFFFFFFFu       /**< \brief (DSU_ADDR) MASK Register */

/* -------- DSU_LENGTH : (DSU Offset: 0x0008) (R/W 32) Length Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 2;         /*!< bit:  0.. 1  Reserved                           */
            uint32_t LENGTH : 30; /*!< bit:  2..31  Length                             */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } DSU_LENGTH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_LENGTH_OFFSET        0x0008          /**< \brief (DSU_LENGTH offset) Length Register */
#define DSU_LENGTH_RESETVALUE    0x00000000      /**< \brief (DSU_LENGTH reset_value) Length Register */

#define DSU_LENGTH_LENGTH_Pos    2               /**< \brief (DSU_LENGTH) Length */
#define DSU_LENGTH_LENGTH_Msk    ( 0x3FFFFFFFu << DSU_LENGTH_LENGTH_Pos )
#define DSU_LENGTH_LENGTH( value )    ( ( DSU_LENGTH_LENGTH_Msk & ( ( value ) << DSU_LENGTH_LENGTH_Pos ) ) )
#define DSU_LENGTH_MASK          0xFFFFFFFCu     /**< \brief (DSU_LENGTH) MASK Register */

/* -------- DSU_DATA : (DSU Offset: 0x000C) (R/W 32) Data Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DATA : 32; /*!< bit:  0..31  Data                               */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_DATA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_DATA_OFFSET      0x000C              /**< \brief (DSU_DATA offset) Data Register */

#define DSU_DATA_DATA_Pos    0                   /**< \brief (DSU_DATA) Data */
#define DSU_DATA_DATA_Msk    ( 0xFFFFFFFFu << DSU_DATA_DATA_Pos )
#define DSU_DATA_DATA( value )    ( ( DSU_DATA_DATA_Msk & ( ( value ) << DSU_DATA_DATA_Pos ) ) )
#define DSU_DATA_MASK        0xFFFFFFFFu         /**< \brief (DSU_DATA) MASK Register */

/* -------- DSU_DCC : (DSU Offset: 0x0010) (R/W 32) Debug Communication Channel Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DATA : 32; /*!< bit:  0..31  Data                               */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_DCC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_DCC_OFFSET        0x0010             /**< \brief (DSU_DCC offset) Debug Communication Channel Register */
#define DSU_DCC_RESETVALUE    0x00000000         /**< \brief (DSU_DCC reset_value) Debug Communication Channel Register */

#define DSU_DCC_DATA_Pos      0                  /**< \brief (DSU_DCC) Data */
#define DSU_DCC_DATA_Msk      ( 0xFFFFFFFFu << DSU_DCC_DATA_Pos )
#define DSU_DCC_DATA( value )    ( ( DSU_DCC_DATA_Msk & ( ( value ) << DSU_DCC_DATA_Pos ) ) )
#define DSU_DCC_MASK          0xFFFFFFFFu        /**< \brief (DSU_DCC) MASK Register */

/* -------- DSU_DID : (DSU Offset: 0x0018) (R/  32) Device Identification Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DEVSEL : 8;    /*!< bit:  0.. 7  Device Select                      */
            uint32_t REVISION : 4;  /*!< bit:  8..11  Revision Number                    */
            uint32_t DIE : 4;       /*!< bit: 12..15  Die Number                         */
            uint32_t SUBFAMILY : 8; /*!< bit: 16..23  Sub-Family                         */
            uint32_t FAMILY : 4;    /*!< bit: 24..27  Family                             */
            uint32_t PROCESSOR : 4; /*!< bit: 28..31  Processor                          */
        } bit;                      /*!< Structure used for bit  access                  */
        uint32_t reg;               /*!< Type      used for register access              */
    } DSU_DID_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_DID_OFFSET           0x0018          /**< \brief (DSU_DID offset) Device Identification Register */
#define DSU_DID_RESETVALUE       0x00000000      /**< \brief (DSU_DID reset_value) Device Identification Register */

#define DSU_DID_DEVSEL_Pos       0               /**< \brief (DSU_DID) Device Select */
#define DSU_DID_DEVSEL_Msk       ( 0xFFu << DSU_DID_DEVSEL_Pos )
#define DSU_DID_DEVSEL( value )       ( ( DSU_DID_DEVSEL_Msk & ( ( value ) << DSU_DID_DEVSEL_Pos ) ) )
#define DSU_DID_REVISION_Pos     8               /**< \brief (DSU_DID) Revision Number */
#define DSU_DID_REVISION_Msk     ( 0xFu << DSU_DID_REVISION_Pos )
#define DSU_DID_REVISION( value )     ( ( DSU_DID_REVISION_Msk & ( ( value ) << DSU_DID_REVISION_Pos ) ) )
#define DSU_DID_DIE_Pos          12              /**< \brief (DSU_DID) Die Number */
#define DSU_DID_DIE_Msk          ( 0xFu << DSU_DID_DIE_Pos )
#define DSU_DID_DIE( value )          ( ( DSU_DID_DIE_Msk & ( ( value ) << DSU_DID_DIE_Pos ) ) )
#define DSU_DID_SUBFAMILY_Pos    16              /**< \brief (DSU_DID) Sub-Family */
#define DSU_DID_SUBFAMILY_Msk    ( 0xFFu << DSU_DID_SUBFAMILY_Pos )
#define DSU_DID_SUBFAMILY( value )    ( ( DSU_DID_SUBFAMILY_Msk & ( ( value ) << DSU_DID_SUBFAMILY_Pos ) ) )
#define DSU_DID_FAMILY_Pos       24              /**< \brief (DSU_DID) Family */
#define DSU_DID_FAMILY_Msk       ( 0xFu << DSU_DID_FAMILY_Pos )
#define DSU_DID_FAMILY( value )       ( ( DSU_DID_FAMILY_Msk & ( ( value ) << DSU_DID_FAMILY_Pos ) ) )
#define DSU_DID_PROCESSOR_Pos    28              /**< \brief (DSU_DID) Processor */
#define DSU_DID_PROCESSOR_Msk    ( 0xFu << DSU_DID_PROCESSOR_Pos )
#define DSU_DID_PROCESSOR( value )    ( ( DSU_DID_PROCESSOR_Msk & ( ( value ) << DSU_DID_PROCESSOR_Pos ) ) )
#define DSU_DID_MASK             0xFFFFFFFFu     /**< \brief (DSU_DID) MASK Register */

/* -------- DSU_DCFG : (DSU Offset: 0x00F0) (R/W 32) Device Configuration Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t DCFG : 32; /*!< bit:  0..31  Device Configuration               */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_DCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_DCFG_OFFSET        0x00F0            /**< \brief (DSU_DCFG offset) Device Configuration Register */
#define DSU_DCFG_RESETVALUE    0x00000000        /**< \brief (DSU_DCFG reset_value) Device Configuration Register */

#define DSU_DCFG_DCFG_Pos      0                 /**< \brief (DSU_DCFG) Device Configuration */
#define DSU_DCFG_DCFG_Msk      ( 0xFFFFFFFFu << DSU_DCFG_DCFG_Pos )
#define DSU_DCFG_DCFG( value )    ( ( DSU_DCFG_DCFG_Msk & ( ( value ) << DSU_DCFG_DCFG_Pos ) ) )
#define DSU_DCFG_MASK          0xFFFFFFFFu       /**< \brief (DSU_DCFG) MASK Register */

/* -------- DSU_UPTM : (DSU Offset: 0x00F8) (R/W 32) UnProtected Test Mode Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t UPTM : 32; /*!< bit:  0..31  Un-Protected Test Mode             */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_UPTM_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_UPTM_OFFSET        0x00F8            /**< \brief (DSU_UPTM offset) UnProtected Test Mode Register */
#define DSU_UPTM_RESETVALUE    0x00000000        /**< \brief (DSU_UPTM reset_value) UnProtected Test Mode Register */

