FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_dsu.h
#define DSU_UPTM_UPTM_Pos      0                 /**< \brief (DSU_UPTM) Un-Protected Test Mode */
#define DSU_UPTM_UPTM_Msk      ( 0xFFFFFFFFu << DSU_UPTM_UPTM_Pos )
#define DSU_UPTM_UPTM( value )    ( ( DSU_UPTM_UPTM_Msk & ( ( value ) << DSU_UPTM_UPTM_Pos ) ) )
#define DSU_UPTM_MASK          0xFFFFFFFFu       /**< \brief (DSU_UPTM) MASK Register */

/* -------- DSU_TESTMODE : (DSU Offset: 0x00FC) (R/W 32) Test Mode Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t TESTMODE : 32; /*!< bit:  0..31  Test Mode                          */
        } bit;                      /*!< Structure used for bit  access                  */
        uint32_t reg;               /*!< Type      used for register access              */
    } DSU_TESTMODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_TESTMODE_OFFSET          0x00FC      /**< \brief (DSU_TESTMODE offset) Test Mode Register */
#define DSU_TESTMODE_RESETVALUE      0x00000000  /**< \brief (DSU_TESTMODE reset_value) Test Mode Register */

#define DSU_TESTMODE_TESTMODE_Pos    0           /**< \brief (DSU_TESTMODE) Test Mode */
#define DSU_TESTMODE_TESTMODE_Msk    ( 0xFFFFFFFFu << DSU_TESTMODE_TESTMODE_Pos )
#define DSU_TESTMODE_TESTMODE( value )    ( ( DSU_TESTMODE_TESTMODE_Msk & ( ( value ) << DSU_TESTMODE_TESTMODE_Pos ) ) )
#define DSU_TESTMODE_MASK            0xFFFFFFFFu /**< \brief (DSU_TESTMODE) MASK Register */

/* -------- DSU_ENTRY : (DSU Offset: 0x1000) (R/  32) CoreSight ROM Table Entry Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t EPRES : 1;   /*!< bit:      0  Entry Present                      */
            uint32_t FMT : 1;     /*!< bit:      1  Format                             */
            uint32_t : 10;        /*!< bit:  2..11  Reserved                           */
            uint32_t ADDOFF : 20; /*!< bit: 12..31  Address Offset                     */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } DSU_ENTRY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_ENTRY_OFFSET        0x1000           /**< \brief (DSU_ENTRY offset) CoreSight ROM Table Entry Register */

#define DSU_ENTRY_EPRES_Pos     0                /**< \brief (DSU_ENTRY) Entry Present */
#define DSU_ENTRY_EPRES         ( 0x1u << DSU_ENTRY_EPRES_Pos )
#define DSU_ENTRY_FMT_Pos       1                /**< \brief (DSU_ENTRY) Format */
#define DSU_ENTRY_FMT           ( 0x1u << DSU_ENTRY_FMT_Pos )
#define DSU_ENTRY_ADDOFF_Pos    12               /**< \brief (DSU_ENTRY) Address Offset */
#define DSU_ENTRY_ADDOFF_Msk    ( 0xFFFFFu << DSU_ENTRY_ADDOFF_Pos )
#define DSU_ENTRY_ADDOFF( value )    ( ( DSU_ENTRY_ADDOFF_Msk & ( ( value ) << DSU_ENTRY_ADDOFF_Pos ) ) )
#define DSU_ENTRY_MASK          0xFFFFF003u      /**< \brief (DSU_ENTRY) MASK Register */

/* -------- DSU_END : (DSU Offset: 0x1008) (R/  32) CoreSight ROM Table End Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t END : 32; /*!< bit:  0..31  End Marker                         */
        } bit;                 /*!< Structure used for bit  access                  */
        uint32_t reg;          /*!< Type      used for register access              */
    } DSU_END_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_END_OFFSET        0x1008             /**< \brief (DSU_END offset) CoreSight ROM Table End Register */
#define DSU_END_RESETVALUE    0x00000000         /**< \brief (DSU_END reset_value) CoreSight ROM Table End Register */

#define DSU_END_END_Pos       0                  /**< \brief (DSU_END) End Marker */
#define DSU_END_END_Msk       ( 0xFFFFFFFFu << DSU_END_END_Pos )
#define DSU_END_END( value )    ( ( DSU_END_END_Msk & ( ( value ) << DSU_END_END_Pos ) ) )
#define DSU_END_MASK          0xFFFFFFFFu        /**< \brief (DSU_END) MASK Register */

/* -------- DSU_MEMTYPE : (DSU Offset: 0x1FCC) (R/  32) CoreSight ROM Table Memory Type Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t SMEMP : 1; /*!< bit:      0  System Memory Present              */
            uint32_t : 31;      /*!< bit:  1..31  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_MEMTYPE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_MEMTYPE_OFFSET       0x1FCC          /**< \brief (DSU_MEMTYPE offset) CoreSight ROM Table Memory Type Register */

#define DSU_MEMTYPE_SMEMP_Pos    0               /**< \brief (DSU_MEMTYPE) System Memory Present */
#define DSU_MEMTYPE_SMEMP        ( 0x1u << DSU_MEMTYPE_SMEMP_Pos )
#define DSU_MEMTYPE_MASK         0x00000001u     /**< \brief (DSU_MEMTYPE) MASK Register */

/* -------- DSU_PID4 : (DSU Offset: 0x1FD0) (R/  32) Peripheral Identification Register 4 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t JEPCC : 4; /*!< bit:  0.. 3  JEP-106 Continuation Code          */
            uint32_t FKBC : 4;  /*!< bit:  4.. 7  4kB Count                          */
            uint32_t : 24;      /*!< bit:  8..31  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } DSU_PID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID4_OFFSET       0x1FD0             /**< \brief (DSU_PID4 offset) Peripheral Identification Register 4 */

