FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_dsu.h
#define DSU_PID4_JEPCC_Pos    0                  /**< \brief (DSU_PID4) JEP-106 Continuation Code */
#define DSU_PID4_JEPCC_Msk    ( 0xFu << DSU_PID4_JEPCC_Pos )
#define DSU_PID4_JEPCC( value )    ( ( DSU_PID4_JEPCC_Msk & ( ( value ) << DSU_PID4_JEPCC_Pos ) ) )
#define DSU_PID4_FKBC_Pos     4                  /**< \brief (DSU_PID4) 4kB Count */
#define DSU_PID4_FKBC_Msk     ( 0xFu << DSU_PID4_FKBC_Pos )
#define DSU_PID4_FKBC( value )     ( ( DSU_PID4_FKBC_Msk & ( ( value ) << DSU_PID4_FKBC_Pos ) ) )
#define DSU_PID4_MASK         0x000000FFu        /**< \brief (DSU_PID4) MASK Register */

/* -------- DSU_PID5 : (DSU Offset: 0x1FD4) (R/  32) Peripheral Identification Register 5 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        uint32_t reg;          /*!< Type      used for register access              */
    } DSU_PID5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID5_OFFSET    0x1FD4                /**< \brief (DSU_PID5 offset) Peripheral Identification Register 5 */
#define DSU_PID5_MASK      0x00000000u           /**< \brief (DSU_PID5) MASK Register */

/* -------- DSU_PID6 : (DSU Offset: 0x1FD8) (R/  32) Peripheral Identification Register 6 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        uint32_t reg;          /*!< Type      used for register access              */
    } DSU_PID6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID6_OFFSET    0x1FD8                /**< \brief (DSU_PID6 offset) Peripheral Identification Register 6 */
#define DSU_PID6_MASK      0x00000000u           /**< \brief (DSU_PID6) MASK Register */

/* -------- DSU_PID7 : (DSU Offset: 0x1FDC) (R/  32) Peripheral Identification Register 7 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        uint32_t reg;          /*!< Type      used for register access              */
    } DSU_PID7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID7_OFFSET    0x1FDC                /**< \brief (DSU_PID7 offset) Peripheral Identification Register 7 */
#define DSU_PID7_MASK      0x00000000u           /**< \brief (DSU_PID7) MASK Register */

/* -------- DSU_PID0 : (DSU Offset: 0x1FE0) (R/  32) Peripheral Identification Register 0 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PARTNBL : 8; /*!< bit:  0.. 7  Part Number Low                    */
            uint32_t : 24;        /*!< bit:  8..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } DSU_PID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID0_OFFSET         0x1FE0           /**< \brief (DSU_PID0 offset) Peripheral Identification Register 0 */

#define DSU_PID0_PARTNBL_Pos    0                /**< \brief (DSU_PID0) Part Number Low */
#define DSU_PID0_PARTNBL_Msk    ( 0xFFu << DSU_PID0_PARTNBL_Pos )
#define DSU_PID0_PARTNBL( value )    ( ( DSU_PID0_PARTNBL_Msk & ( ( value ) << DSU_PID0_PARTNBL_Pos ) ) )
#define DSU_PID0_MASK           0x000000FFu      /**< \brief (DSU_PID0) MASK Register */

/* -------- DSU_PID1 : (DSU Offset: 0x1FE4) (R/  32) Peripheral Identification Register 1 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PARTNBH : 4; /*!< bit:  0.. 3  Part Number High                   */
            uint32_t JEPIDCL : 4; /*!< bit:  4.. 7  JEP-106 Identity Code Low          */
            uint32_t : 24;        /*!< bit:  8..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } DSU_PID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID1_OFFSET         0x1FE4           /**< \brief (DSU_PID1 offset) Peripheral Identification Register 1 */

#define DSU_PID1_PARTNBH_Pos    0                /**< \brief (DSU_PID1) Part Number High */
#define DSU_PID1_PARTNBH_Msk    ( 0xFu << DSU_PID1_PARTNBH_Pos )
#define DSU_PID1_PARTNBH( value )    ( ( DSU_PID1_PARTNBH_Msk & ( ( value ) << DSU_PID1_PARTNBH_Pos ) ) )
#define DSU_PID1_JEPIDCL_Pos    4                /**< \brief (DSU_PID1) JEP-106 Identity Code Low */
#define DSU_PID1_JEPIDCL_Msk    ( 0xFu << DSU_PID1_JEPIDCL_Pos )
#define DSU_PID1_JEPIDCL( value )    ( ( DSU_PID1_JEPIDCL_Msk & ( ( value ) << DSU_PID1_JEPIDCL_Pos ) ) )
#define DSU_PID1_MASK           0x000000FFu      /**< \brief (DSU_PID1) MASK Register */

/* -------- DSU_PID2 : (DSU Offset: 0x1FE8) (R/  32) Peripheral Identification Register 2 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t JEPIDCH : 3;  /*!< bit:  0.. 2  JEP-106 Identity Code High         */
            uint32_t JEPU : 1;     /*!< bit:      3  JEP-106 Identity Code is Used      */
            uint32_t REVISION : 4; /*!< bit:  4.. 7  Revision Number                    */
            uint32_t : 24;         /*!< bit:  8..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } DSU_PID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_PID2_OFFSET          0x1FE8          /**< \brief (DSU_PID2 offset) Peripheral Identification Register 2 */

#define DSU_PID2_JEPIDCH_Pos     0               /**< \brief (DSU_PID2) JEP-106 Identity Code High */
#define DSU_PID2_JEPIDCH_Msk     ( 0x7u << DSU_PID2_JEPIDCH_Pos )
#define DSU_PID2_JEPIDCH( value )    ( ( DSU_PID2_JEPIDCH_Msk & ( ( value ) << DSU_PID2_JEPIDCH_Pos ) ) )
#define DSU_PID2_JEPU_Pos        3               /**< \brief (DSU_PID2) JEP-106 Identity Code is Used */
#define DSU_PID2_JEPU            ( 0x1u << DSU_PID2_JEPU_Pos )
#define DSU_PID2_REVISION_Pos    4               /**< \brief (DSU_PID2) Revision Number */
#define DSU_PID2_REVISION_Msk    ( 0xFu << DSU_PID2_REVISION_Pos )
#define DSU_PID2_REVISION( value )    ( ( DSU_PID2_REVISION_Msk & ( ( value ) << DSU_PID2_REVISION_Pos ) ) )
#define DSU_PID2_MASK            0x000000FFu     /**< \brief (DSU_PID2) MASK Register */

/* -------- DSU_PID3 : (DSU Offset: 0x1FEC) (R/  32) Peripheral Identification Register 3 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t CUSMOD : 4; /*!< bit:  0.. 3  Customer Mode                      */
            uint32_t REVAND : 4; /*!< bit:  4.. 7  Revision Number                    */
            uint32_t : 24;       /*!< bit:  8..31  Reserved                           */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } DSU_PID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

