FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_dsu.h
#define DSU_PID3_OFFSET        0x1FEC            /**< \brief (DSU_PID3 offset) Peripheral Identification Register 3 */

#define DSU_PID3_CUSMOD_Pos    0                 /**< \brief (DSU_PID3) Customer Mode */
#define DSU_PID3_CUSMOD_Msk    ( 0xFu << DSU_PID3_CUSMOD_Pos )
#define DSU_PID3_CUSMOD( value )    ( ( DSU_PID3_CUSMOD_Msk & ( ( value ) << DSU_PID3_CUSMOD_Pos ) ) )
#define DSU_PID3_REVAND_Pos    4                 /**< \brief (DSU_PID3) Revision Number */
#define DSU_PID3_REVAND_Msk    ( 0xFu << DSU_PID3_REVAND_Pos )
#define DSU_PID3_REVAND( value )    ( ( DSU_PID3_REVAND_Msk & ( ( value ) << DSU_PID3_REVAND_Pos ) ) )
#define DSU_PID3_MASK          0x000000FFu       /**< \brief (DSU_PID3) MASK Register */

/* -------- DSU_CID0 : (DSU Offset: 0x1FF0) (R/  32) Component Identification Register 0 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PREAMBLEB0 : 8; /*!< bit:  0.. 7  Preamble Byte 0                    */
            uint32_t : 24;           /*!< bit:  8..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } DSU_CID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_CID0_OFFSET            0x1FF0        /**< \brief (DSU_CID0 offset) Component Identification Register 0 */
#define DSU_CID0_RESETVALUE        0x00000000    /**< \brief (DSU_CID0 reset_value) Component Identification Register 0 */

#define DSU_CID0_PREAMBLEB0_Pos    0             /**< \brief (DSU_CID0) Preamble Byte 0 */
#define DSU_CID0_PREAMBLEB0_Msk    ( 0xFFu << DSU_CID0_PREAMBLEB0_Pos )
#define DSU_CID0_PREAMBLEB0( value )    ( ( DSU_CID0_PREAMBLEB0_Msk & ( ( value ) << DSU_CID0_PREAMBLEB0_Pos ) ) )
#define DSU_CID0_MASK              0x000000FFu   /**< \brief (DSU_CID0) MASK Register */

/* -------- DSU_CID1 : (DSU Offset: 0x1FF4) (R/  32) Component Identification Register 1 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PREAMBLE : 4; /*!< bit:  0.. 3  Preamble Byte 1                    */
            uint32_t CCLASS : 4;   /*!< bit:  4.. 7  Component Class                    */
            uint32_t : 24;         /*!< bit:  8..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } DSU_CID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_CID1_OFFSET          0x1FF4          /**< \brief (DSU_CID1 offset) Component Identification Register 1 */
#define DSU_CID1_RESETVALUE      0x00000000      /**< \brief (DSU_CID1 reset_value) Component Identification Register 1 */

#define DSU_CID1_PREAMBLE_Pos    0               /**< \brief (DSU_CID1) Preamble Byte 1 */
#define DSU_CID1_PREAMBLE_Msk    ( 0xFu << DSU_CID1_PREAMBLE_Pos )
#define DSU_CID1_PREAMBLE( value )    ( ( DSU_CID1_PREAMBLE_Msk & ( ( value ) << DSU_CID1_PREAMBLE_Pos ) ) )
#define DSU_CID1_CCLASS_Pos      4               /**< \brief (DSU_CID1) Component Class */
#define DSU_CID1_CCLASS_Msk      ( 0xFu << DSU_CID1_CCLASS_Pos )
#define DSU_CID1_CCLASS( value )      ( ( DSU_CID1_CCLASS_Msk & ( ( value ) << DSU_CID1_CCLASS_Pos ) ) )
#define DSU_CID1_MASK            0x000000FFu     /**< \brief (DSU_CID1) MASK Register */

/* -------- DSU_CID2 : (DSU Offset: 0x1FF8) (R/  32) Component Identification Register 2 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PREAMBLEB2 : 8; /*!< bit:  0.. 7  Preamble Byte 2                    */
            uint32_t : 24;           /*!< bit:  8..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } DSU_CID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_CID2_OFFSET            0x1FF8        /**< \brief (DSU_CID2 offset) Component Identification Register 2 */
#define DSU_CID2_RESETVALUE        0x00000000    /**< \brief (DSU_CID2 reset_value) Component Identification Register 2 */

#define DSU_CID2_PREAMBLEB2_Pos    0             /**< \brief (DSU_CID2) Preamble Byte 2 */
#define DSU_CID2_PREAMBLEB2_Msk    ( 0xFFu << DSU_CID2_PREAMBLEB2_Pos )
#define DSU_CID2_PREAMBLEB2( value )    ( ( DSU_CID2_PREAMBLEB2_Msk & ( ( value ) << DSU_CID2_PREAMBLEB2_Pos ) ) )
#define DSU_CID2_MASK              0x000000FFu   /**< \brief (DSU_CID2) MASK Register */

/* -------- DSU_CID3 : (DSU Offset: 0x1FFC) (R/  32) Component Identification Register 3 -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t PREAMBLEB3 : 8; /*!< bit:  0.. 7  Preamble Byte 3                    */
            uint32_t : 24;           /*!< bit:  8..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } DSU_CID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define DSU_CID3_OFFSET            0x1FFC        /**< \brief (DSU_CID3 offset) Component Identification Register 3 */
#define DSU_CID3_RESETVALUE        0x00000000    /**< \brief (DSU_CID3 reset_value) Component Identification Register 3 */

#define DSU_CID3_PREAMBLEB3_Pos    0             /**< \brief (DSU_CID3) Preamble Byte 3 */
#define DSU_CID3_PREAMBLEB3_Msk    ( 0xFFu << DSU_CID3_PREAMBLEB3_Pos )
#define DSU_CID3_PREAMBLEB3( value )    ( ( DSU_CID3_PREAMBLEB3_Msk & ( ( value ) << DSU_CID3_PREAMBLEB3_Pos ) ) )
#define DSU_CID3_MASK              0x000000FFu   /**< \brief (DSU_CID3) MASK Register */

