FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_dsu.h
/** \brief DSU hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __O DSU_CTRL_Type CTRL;               /**< \brief Offset: 0x0000 ( /W  8) Control Register */
        __IO DSU_STATUSA_Type STATUSA;        /**< \brief Offset: 0x0001 (R/W  8) Status Register A */
        __I DSU_STATUSB_Type STATUSB;         /**< \brief Offset: 0x0002 (R/   8) Status Register B */
        RoReg8 Reserved1[ 0x1 ];
        __IO DSU_ADDR_Type ADDR;              /**< \brief Offset: 0x0004 (R/W 32) Address Register */
        __IO DSU_LENGTH_Type LENGTH;          /**< \brief Offset: 0x0008 (R/W 32) Length Register */
        __IO DSU_DATA_Type DATA;              /**< \brief Offset: 0x000C (R/W 32) Data Register */
        __IO DSU_DCC_Type DCC[ 2 ];           /**< \brief Offset: 0x0010 (R/W 32) Debug Communication Channel Register */
        __I DSU_DID_Type DID;                 /**< \brief Offset: 0x0018 (R/  32) Device Identification Register */
        RoReg8 Reserved2[ 0xD4 ];
        __IO DSU_DCFG_Type DCFG[ 2 ];         /**< \brief Offset: 0x00F0 (R/W 32) Device Configuration Register */
        __IO DSU_UPTM_Type UPTM;              /**< \brief Offset: 0x00F8 (R/W 32) UnProtected Test Mode Register */
        __IO DSU_TESTMODE_Type TESTMODE;      /**< \brief Offset: 0x00FC (R/W 32) Test Mode Register */
        RoReg8 Reserved3[ 0xF00 ];
        __I DSU_ENTRY_Type ENTRY[ 2 ];        /**< \brief Offset: 0x1000 (R/  32) CoreSight ROM Table Entry Register */
        __I DSU_END_Type END;                 /**< \brief Offset: 0x1008 (R/  32) CoreSight ROM Table End Register */
        RoReg8 Reserved4[ 0xFC0 ];
        __I DSU_MEMTYPE_Type MEMTYPE;         /**< \brief Offset: 0x1FCC (R/  32) CoreSight ROM Table Memory Type Register */
        __I DSU_PID4_Type PID4;               /**< \brief Offset: 0x1FD0 (R/  32) Peripheral Identification Register 4 */
        __I DSU_PID5_Type PID5;               /**< \brief Offset: 0x1FD4 (R/  32) Peripheral Identification Register 5 */
        __I DSU_PID6_Type PID6;               /**< \brief Offset: 0x1FD8 (R/  32) Peripheral Identification Register 6 */
        __I DSU_PID7_Type PID7;               /**< \brief Offset: 0x1FDC (R/  32) Peripheral Identification Register 7 */
        __I DSU_PID0_Type PID0;               /**< \brief Offset: 0x1FE0 (R/  32) Peripheral Identification Register 0 */
        __I DSU_PID1_Type PID1;               /**< \brief Offset: 0x1FE4 (R/  32) Peripheral Identification Register 1 */
        __I DSU_PID2_Type PID2;               /**< \brief Offset: 0x1FE8 (R/  32) Peripheral Identification Register 2 */
        __I DSU_PID3_Type PID3;               /**< \brief Offset: 0x1FEC (R/  32) Peripheral Identification Register 3 */
        __I DSU_CID0_Type CID0;               /**< \brief Offset: 0x1FF0 (R/  32) Component Identification Register 0 */
        __I DSU_CID1_Type CID1;               /**< \brief Offset: 0x1FF4 (R/  32) Component Identification Register 1 */
        __I DSU_CID2_Type CID2;               /**< \brief Offset: 0x1FF8 (R/  32) Component Identification Register 2 */
        __I DSU_CID3_Type CID3;               /**< \brief Offset: 0x1FFC (R/  32) Component Identification Register 3 */
    } Dsu;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_DSU_COMPONENT_ */
